In [6]:
cid = ['cid-0001', 'cid-0002', 'cid-0003', 'cid-0004', 'cid-0005']
credit_score = [650, 723, 581, 462, 773]  
age_of_customer = [25, 28, 38, 41, 62]     
debt_status = ['no-debt', 'no-debt', 'no-debt', 'in-debt', 'no-debt'] 
no_of_existing_credit_cards = [3, 2, 4, 1, 2]
prec_on_time = [0.62, 0.78, 0.20, 0.32, 0.85]
df1 = {
    'cust_id': cid, 
    'cred_score': credit_score, 
    'age': age_of_customer,
    'debt_status':debt_status,
    'curr_cred_cards':no_of_existing_credit_cards
}
import pandas as pd
df = pd.DataFrame(df1)
df

    cust_id  cred_score  age debt_status  curr_cred_cards
0  cid-0001         650   25     no-debt                3
1  cid-0002         723   28     no-debt                2
2  cid-0003         581   38     no-debt                4
3  cid-0004         462   41     in-debt                1
4  cid-0005         773   62     no-debt                2

In [7]:
df.describe()

       cred_score        age  curr_cred_cards
count    5.000000   5.000000         5.000000
mean   637.800000  38.800000         2.400000
std    122.289411  14.584238         1.140175
min    462.000000  25.000000         1.000000
25%    581.000000  28.000000         2.000000
50%    650.000000  38.000000         2.000000
75%    723.000000  41.000000         3.000000
max    773.000000  62.000000         4.000000

In [8]:
df.shape

(5, 5)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   cust_id          5 non-null      object
 1   cred_score       5 non-null      int64
 2   age              5 non-null      int64
 3   debt_status      5 non-null      object
 4   curr_cred_cards  5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes